КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул7/КонтурЛогистика_ТрН_Титул7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ТрН_Титул7</name>
  <posting>Deny</posting>
  <attributes>
    <name>ЭтоВозвратнаяЦепочка</name>
    <comment>показывате что переадресовки были на обратном пути следования после неполной приемки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЭТРН</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтметкиПА</name>
    <comment>есть ли в титуле элемент ОтметкиПА</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнфПА</name>
    <comment>Дата формирования файла обмена информации о переадресовке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПА</name>
    <comment>Время формирования файла обмена информации о переадресовке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭППВ</name>
    <comment>Электронная подпись файла обмена информации перевозчика о приеме груза</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>НомИспр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаимДокОснПА</name>
    <comment>Наименование документа основания переадресовки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокОснПА</name>
    <comment>Номер документа основания переадресовки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокОснПА</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведДокОснПА</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтороныСостДокОснПА</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСостДокОснПА</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдДокОснПА</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовГрузПол</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>АдрВыгруз</name>
    <comment>Сведения о новом пункте выгрузки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрНовВыгрПА</name>
    <comment>Новые дата и время подачи транспортного средства под выгрузку</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатПодп</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭПУвПА</name>
    <comment>Электронная подпись уведомления перевозчика грузоотправителем или грузополучателем о переадресовке груза в электронной форме</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлПрвПрием</name>
    <comment>Идентификатор файла обмена информации перевозчика о приеме груза</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлПрвПрием</name>
    <comment>Дата формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлПрвПрием</name>
    <comment>Время формирования файла обмена информации перевозчика о приеме груза к перевозке</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрПА</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредГрузополучатель</name>
    <comment>Старый ГП из ЭТрН</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредМестоВыгрузки</name>
    <comment>Старый Пункт маршрута  из ЭТрН</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредЗаявДатВрПриб</name>
    <comment>Старое значение из Т4</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиПА</name>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтметкиИнфПол</name>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфИдентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстИнфЗначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ТрН_Титул7/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьДанныеФормы();

	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("Группа2");
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаПодписьПеревозчика");
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
	Элементы.ДокументОснование.Доступность = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ТипыДокументаОснованияНастроеныДляТитула(7);
	
	ТумблерЗаполненИДОснПА = ЗначениеЗаполнено(Объект.ИдДокОснПА);
	Если Не ТумблерЗаполненИДОснПА Тогда 
		ЗаполнитьДанныеДокумента(Объект, "ОснПА");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// ОбновитьДанныеФормы();
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		// не нужно закрывать титул после выполнения действия по-умолчанию
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "ПерезаполнитьТитул"
		И Параметр <> Неопределено
		И Параметр = Объект.Ссылка Тогда
		
		ПерезаполнитьПоДокОснованиюСервер();
		ОбновитьДанныеФормы();
		ОбновитьОтображениеДанных();
		ПроверитьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ОповеститьОбИзменении(Объект.ДокументЭТРН);
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ЭтаФорма.Прочитать();
	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ГрузополучательИзменился = ЗначениеЗаполнено(Объект.НовГрузПол) И Объект.НовГрузПол <> Объект.ПредГрузополучатель;
	Элементы.НовГрузПол.Видимость = ГрузополучательИзменился;
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЭТРН, Истина);
	
	ПерешелВЛогистическиеСтатус = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Повторно подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование ,Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена Тогда
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	Элементы.ПредЗаявДатВрПриб.Видимость = ЗначениеЗаполнено(Объект.ПредЗаявДатВрПриб);
	
	//ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	//Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	//
	//Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Видимость = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик;
	//
	//Элементы.ПерезаполнитьПоДокОснованию.Видимость = НЕ ЭтоВходящий И ЕстьДокУчСист;
	//Элементы.Подписант.Видимость = НЕ ЭтоВходящий;
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьЧерезНастройкиКонвертации();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса(ПриСоздании = Ложь)
	
	СтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик 
		Или СтатусТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		Или СтатусТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена")
		Или (СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка И ЗначениеЗаполнено(Объект.ДокументЭТРН.УИД)) Тогда
		
		ТолькоПросмотр = Макс(Ложь, ТолькоПросмотр);
		Элементы.ГруппаИсправление.Видимость = Объект.НомИспр > 0;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ТолькоПросмотр = Истина;
		Элементы.ГруппаИсправление.Видимость = Истина;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	ЭтоИсправлениеОшибки = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка");
	
	Элементы.ГруппаОтметкиНадпись.Видимость = ЭтоВходящий ИЛИ Не ЭтоЧерновик;
	Элементы.ГруппаОтметкиТумблер.Видимость = ЭтоЧерновик ИЛИ ЭтоИсправлениеОшибки;
	
	Элементы.ГруппаОтметки.Видимость = Объект.ЕстьОтметкиПА;
	
	Элементы.ГруппаПодписьПеревозчика.Видимость = ЗначениеЗаполнено(Объект.Фамилия);

	Элементы.ГруппаОснПАДокумент.Видимость 	= Не ТумблерЗаполненИДОснПА;
	Элементы.ГруппаОснПАИд.Видимость 		= ТумблерЗаполненИДОснПА;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьОтметкиПеревозчика1ПриИзменении(Элемент)
	УправлениеВидимостьюИДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ЕстьЗамечанияПеревозчика1ПриИзменении(Элемент)
	УправлениеВидимостьюИДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ТрН_Титул7.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции


// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиДобавить(Команда)
	
	НоваяСтрока = Объект.ОтметкиПА.Добавить();
	НоваяСтрока.ДатаИВремяОтметки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТекущийМоментВремени();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиСкопировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ИдДокДокОснПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура НаимДокументаОснованияПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура НомерДокументаОснованияПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ДатаДокументаОснованияПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ДопСведДокументаОснованияПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура СтороныСоставителиДокументаОснованияПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ДопСостДокОснПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ДатВрПАДатаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ДатВрПАВремяПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ДатВрНовВыгрПАПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ДатВрНовВыгрПА1ПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура НовГрузПолПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура АдрВыгрузПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры


&НаКлиенте
Процедура ТумблерЗаполненИДОснПАПриИзменении(Элемент)
	
	ОчиститьДанныеДокумента(Объект, "ОснПА");
	
	Если Не ТумблерЗаполненИДОснПА Тогда 
		ЗаполнитьДанныеДокумента(Объект, "ОснПА");
	КонецЕсли;
	
	УправлениеВидимостьюИДоступностью();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовуюДатуДоставкиТекущим(Команда)
	Объект.ДатВрНовВыгрПА = ТекущаяДата();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовуюДатуПереадресацииТекущим(Команда)
	Объект.ДатВрПА = ТекущаяДата();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Функция ОчиститьДанныеДокумента(ОбъектДокумента, ПостФикс = "") 
	
	ОбъектДокумента["ИдДок" + ПостФикс] = "";
	ОбъектДокумента["НаимДок" + ПостФикс] = "";
	ОбъектДокумента["НомерДок" + ПостФикс] = "";
	ОбъектДокумента["ДатаДок" + ПостФикс] = "";
	ОбъектДокумента["ДопСведДок" + ПостФикс] = "";
	ОбъектДокумента["СтороныСостДок" + ПостФикс] = "";
	ОбъектДокумента["ДопСостДок" + ПостФикс] = "";
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьДанныеДокумента(ОбъектДокумента, ПостФикс = "") 
	
	ОбъектДокумента["ДатаДок" + ПостФикс] = ТекущаяДата();
		
КонецФункции

&НаКлиенте
Процедура ОтметкиПАПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ОтметкиПА.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	нСтроки = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", ТекДанные.ИдентификаторСтроки));
	Для каждого Строка Из нСтроки Цикл
		Объект.Акты.Удалить(Строка);
	КонецЦикла;
	
	нСтроки = Объект.Штрафы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", ТекДанные.ИдентификаторСтроки));
	Для каждого Строка Из нСтроки Цикл
		Объект.Штрафы.Удалить(Строка);
	КонецЦикла;
	
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПАПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПАПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательИзменилсяПриИзменении(Элемент)
	
	УстановитьВидимостьНовогоГрузополучателя();
	
КонецПроцедуры

Процедура УстановитьВидимостьНовогоГрузополучателя()

	Элементы.НовГрузПол.Видимость = ГрузополучательИзменился;

КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
